; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	thermograph3 - mode
	infrared2 - mode
	thermograph4 - mode
	infrared0 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star6 - direction
	Star7 - direction
	GroundStation4 - direction
	Star5 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(supports instrument0 thermograph4)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
)
(:goal (and
	(have_image Phenomenon8 thermograph3)
	(have_image Phenomenon9 thermograph3)
	(have_image Planet10 infrared2)
	(have_image Phenomenon11 infrared2)
	(have_image Planet12 infrared2)
	(have_image Planet13 thermograph3)
))

)

; plan
1. (turn_to satellite0 groundstation4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 planet12 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet12)
   goals met: 0 of 6
5. (take_image satellite0 planet12 instrument0 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 1 of 6
6. (turn_to satellite0 planet10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet10)
   goals met: 1 of 6
7. (take_image satellite0 planet10 instrument0 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon11 instrument0 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 3 of 6
10. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 6
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 6
12. (turn_to satellite0 star5 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star5)
   goals met: 3 of 6
13. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 3 of 6
14. (turn_to satellite0 phenomenon8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 6
15. (take_image satellite0 phenomenon8 instrument1 thermograph3)
   added: (have_image phenomenon8 thermograph3)
   goals met: 4 of 6
16. (turn_to satellite0 phenomenon9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 6
17. (take_image satellite0 phenomenon9 instrument1 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 5 of 6
18. (turn_to satellite0 planet13 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet13)
   goals met: 5 of 6
19. (take_image satellite0 planet13 instrument1 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 6 of 6
